src/main/java/ok/dht/test/slastin/wrk2/data/puts-30000.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 54.060ms, rate sampling interval: 305ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.88ms   65.91ms 261.89ms   82.68%
    Req/Sec    30.18k     2.86k   37.15k    72.39%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.97ms
 75.000%   66.24ms
 90.000%  155.77ms
 99.000%  244.35ms
 99.900%  258.17ms
 99.990%  261.63ms
 99.999%  262.02ms
100.000%  262.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.023     0.000000           34         1.00
       0.253     0.100000       151040         1.11
       0.475     0.200000       301628         1.25
       0.695     0.300000       452599         1.43
       0.914     0.400000       603204         1.67
       1.973     0.500000       753431         2.00
       7.315     0.550000       828798         2.22
      15.855     0.600000       904132         2.50
      27.423     0.650000       979537         2.86
      43.775     0.700000      1054898         3.33
      66.239     0.750000      1130233         4.00
      79.551     0.775000      1167946         4.44
      93.759     0.800000      1205598         5.00
     107.583     0.825000      1243308         5.71
     121.087     0.850000      1281033         6.67
     136.575     0.875000      1318659         8.00
     146.687     0.887500      1337375         8.89
     155.775     0.900000      1356184        10.00
     164.991     0.912500      1375105        11.43
     177.279     0.925000      1394042        13.33
     185.599     0.937500      1412821        16.00
     190.207     0.943750      1422106        17.78
     195.455     0.950000      1431689        20.00
     200.191     0.956250      1440990        22.86
     206.591     0.962500      1450449        26.67
     215.039     0.968750      1459795        32.00
     219.647     0.971875      1464594        35.56
     224.255     0.975000      1469290        40.00
     228.607     0.978125      1473921        45.71
     233.215     0.981250      1478688        53.33
     237.567     0.984375      1483461        64.00
     239.487     0.985938      1485727        71.11
     241.535     0.987500      1488165        80.00
     243.455     0.989062      1490501        91.43
     245.247     0.990625      1492801       106.67
     247.551     0.992188      1495111       128.00
     248.575     0.992969      1496341       142.22
     249.471     0.993750      1497605       160.00
     250.239     0.994531      1498801       182.86
     251.007     0.995313      1499867       213.33
     252.287     0.996094      1501024       256.00
     252.799     0.996484      1501586       284.44
     253.951     0.996875      1502218       320.00
     254.719     0.997266      1502777       365.71
     255.487     0.997656      1503445       426.67
     256.127     0.998047      1503991       512.00
     256.383     0.998242      1504234       568.89
     256.767     0.998437      1504552       640.00
     257.279     0.998633      1504839       731.43
     257.791     0.998828      1505151       853.33
     258.303     0.999023      1505446      1024.00
     258.559     0.999121      1505595      1137.78
     258.815     0.999219      1505706      1280.00
     259.071     0.999316      1505837      1462.86
     259.583     0.999414      1505988      1706.67
     260.095     0.999512      1506142      2048.00
     260.351     0.999561      1506212      2275.56
     260.607     0.999609      1506275      2560.00
     260.863     0.999658      1506358      2925.71
     261.119     0.999707      1506474      3413.33
     261.247     0.999756      1506535      4096.00
     261.247     0.999780      1506535      4551.11
     261.375     0.999805      1506582      5120.00
     261.503     0.999829      1506661      5851.43
     261.503     0.999854      1506661      6826.67
     261.631     0.999878      1506715      8192.00
     261.631     0.999890      1506715      9102.22
     261.631     0.999902      1506715     10240.00
     261.759     0.999915      1506763     11702.86
     261.759     0.999927      1506763     13653.33
     261.887     0.999939      1506825     16384.00
     261.887     0.999945      1506825     18204.44
     261.887     0.999951      1506825     20480.00
     261.887     0.999957      1506825     23405.71
     261.887     0.999963      1506825     27306.67
     261.887     0.999969      1506825     32768.00
     261.887     0.999973      1506825     36408.89
     261.887     0.999976      1506825     40960.00
     261.887     0.999979      1506825     46811.43
     262.015     0.999982      1506857     54613.33
     262.015     1.000000      1506857          inf
#[Mean    =       42.879, StdDeviation   =       65.912]
#[Max     =      261.888, Total count    =      1506857]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1799981 requests in 1.00m, 115.01MB read
Requests/sec:  29999.40
Transfer/sec:      1.92MB